Tutorials-4.1/monopole1D/system/fwhControl
dipoleFwhTest
{
        type            FfowcsWilliamsHawkings;
        #include        "commonSettings";
        patches ("sphere");
        interpolationScheme cell;
        formulationType Farassat1AFormulation;
        cleanFreq       100;
        
        surfaces
        (
                sphere
                {
                    type            patch;
                    patches         ("sphere");
                    interpolate     false;
                }
        );
        
        nonUniformSurfaceMotion false;
        Ufwh		(.0 .0 .0);
}
